<template>
  <el-main>
    <!-- 便利贴1 -->
    <section class="left">

      <!-- 便利贴1 -->
      <div class="item one">
        <img src="../assets/note_1.svg" alt="">
        <p class="title">{{ knowledgeList[knowledgeIndex[0]].title }}</p>
        <p class="content"><span class="barrier"></span>{{ knowledgeList[knowledgeIndex[0]].content }}</p>
      </div>

      <!-- 便利贴2 -->
      <div class="item two">
        <img src="../assets/note_2.svg" alt="">
        <p class="title">{{ knowledgeList[knowledgeIndex[1]].title }}</p>
        <p class="content"><span class="barrier"></span>{{ knowledgeList[knowledgeIndex[1]].content }}</p>

      </div>

      <!-- 便利贴3 -->
      <div class="item three">

        <img src="../assets/note_3.svg" alt="">
        <p class="title">{{ knowledgeList[knowledgeIndex[2]].title }}</p>
        <p class="content"><span class="barrier"></span>{{ knowledgeList[knowledgeIndex[2]].content }}</p>
      </div>

      <!-- 便利贴4 -->
      <div class="item four">
        <img src="../assets/note_4.svg" alt="">
        <p class="title">{{ knowledgeList[knowledgeIndex[3]].title }}</p>
        <p class="content"><span class="barrier"></span>{{ knowledgeList[knowledgeIndex[3]].content }}</p>
      </div>

      <!-- 装饰图片 -->
      <div class="decoration">
        <svg xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink" width="69.5074462890625" height="69.50732421875" viewBox="0 0 69.5074462890625 69.50732421875" fill="none" v-for="item in 7" :key="item">
          <path d="M35.4057 31.0607C26.2412 29.4448 10.7494 41.321 9.17255 50.2639C8.46236 54.2916 11.1321 57.2434 16.3174 58.1577C21.9539 59.1516 26.1861 56.9135 30.7066 57.7105C35.2663 58.5145 38.4883 62.0671 44.0751 63.0522C49.2604 63.9665 52.7787 62.1058 53.4889 58.0781C55.0658 49.1352 44.5702 32.6767 35.4057 31.0607ZM18.6651 26.6084C18.17 22.3979 14.929 19.1562 11.4267 19.3668C7.92444 19.5775 5.48733 23.1615 5.98246 27.3719C6.47758 31.5824 9.71859 34.8242 13.2209 34.6135C16.7231 34.4028 19.1603 30.8189 18.6651 26.6084ZM28.8653 25.9342C32.6016 25.6244 35.2387 21.1154 34.7559 15.8635C34.273 10.6116 30.8525 6.60637 27.1162 6.91617C23.3798 7.22598 20.7427 11.735 21.2256 16.9869C21.7084 22.2388 25.1299 26.2454 28.8653 25.9342ZM61.9368 28.2743C58.7177 26.8785 54.5646 28.8164 52.6581 32.6034C50.7528 36.3907 51.8171 40.592 55.0361 41.9879C58.2552 43.3837 62.4083 41.4457 64.3151 37.6588C66.2204 33.8715 65.1561 29.6701 61.9368 28.2743ZM43.305 28.4803C46.7101 30.0494 51.2942 27.4556 53.5442 22.6855C55.7942 17.9155 54.8581 12.7776 51.4532 11.2075C48.0484 9.63727 43.4641 12.2322 41.2141 17.0022C38.9641 21.7723 39.9 26.9113 43.305 28.4803Z"   fill="#FF8D1A" >
          </path>
        </svg>
        <svg xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink" width="60" height="60" viewBox="0 0 60 60" fill="none"  v-for="item in 4" :key="item">
          <g  clip-path="url(#clip-path-85_80)">
          <path d="M47.13 12.87C47.1271 12.8065 47.1234 12.7431 47.1189 12.6798C47.1145 12.6164 47.1094 12.5531 47.1035 12.4898C47.0976 12.4265 47.0911 12.3633 47.0837 12.3003C47.0764 12.2371 47.0683 12.1741 47.0596 12.1112C47.0508 12.0483 47.0413 11.9855 47.0311 11.9228C47.0209 11.8601 47.0099 11.7975 46.9983 11.7351C46.9867 11.6726 46.9743 11.6103 46.9612 11.5481C46.9481 11.486 46.9343 11.424 46.9197 11.3622C46.9053 11.3003 46.89 11.2386 46.8741 11.1771C46.8582 11.1156 46.8415 11.0543 46.8242 10.9932C46.8068 10.932 46.7888 10.8711 46.7701 10.8105C46.7514 10.7498 46.732 10.6893 46.7118 10.629C46.6917 10.5687 46.6709 10.5087 46.6493 10.449C46.6278 10.3892 46.6056 10.3297 46.5828 10.2704C46.5599 10.2111 46.5364 10.1521 46.5121 10.0934C46.4879 10.0347 46.463 9.97626 46.4374 9.9181C46.4119 9.85993 46.3856 9.80208 46.3587 9.74454C46.3318 9.687 46.3042 9.62977 46.276 9.57286C46.2478 9.51595 46.2189 9.45935 46.1894 9.40306C46.1599 9.34681 46.1297 9.29091 46.0989 9.23536C46.0681 9.17982 46.0367 9.12462 46.0046 9.06978C45.9725 9.01493 45.9398 8.96046 45.9065 8.90636C45.8732 8.85229 45.8393 8.7986 45.8047 8.74529C45.7701 8.69201 45.735 8.63911 45.6992 8.58661C45.6634 8.53411 45.6271 8.48202 45.5901 8.43034C45.5531 8.37871 45.5155 8.32747 45.4774 8.27665C45.4393 8.22587 45.4005 8.17552 45.3612 8.1256C45.322 8.07568 45.2821 8.02622 45.2416 7.97724C45.2011 7.92825 45.1602 7.87974 45.1186 7.83169C45.077 7.78364 45.0349 7.73608 44.9922 7.68902C44.9496 7.64191 44.9065 7.59531 44.8627 7.54921C44.819 7.50316 44.7747 7.45759 44.73 7.41251C44.6338 7.3152 44.5352 7.22032 44.4343 7.12786C44.3334 7.03544 44.2302 6.94556 44.1249 6.85821C44.0195 6.77083 43.9121 6.68612 43.8026 6.60409C43.6931 6.52202 43.5816 6.44269 43.4682 6.36609C43.3547 6.28952 43.2395 6.21579 43.1225 6.14489C43.0054 6.074 42.8867 6.00603 42.7663 5.94099C42.6459 5.87596 42.5239 5.81392 42.4005 5.75489C42.277 5.69586 42.1521 5.63989 42.0259 5.58701C41.8997 5.53412 41.7723 5.48438 41.6436 5.43777C41.5149 5.39117 41.3852 5.34776 41.2544 5.30755C41.1236 5.26733 40.9919 5.23037 40.8592 5.19664C40.7266 5.16292 40.5933 5.13248 40.4591 5.10533C40.325 5.07818 40.1903 5.05435 40.0549 5.03383C39.9197 5.01332 39.7839 4.99615 39.6477 4.98233C39.5116 4.9685 39.3752 4.95804 39.2385 4.95093C39.1019 4.94383 38.9651 4.94009 38.8282 4.93973C38.6914 4.93936 38.5547 4.94236 38.4179 4.94873C38.2812 4.95511 38.1447 4.96484 38.0085 4.97794C37.8723 4.99104 37.7365 5.00748 37.6011 5.02727C37.4657 5.04705 37.3308 5.07017 37.1965 5.0966C37.0623 5.12303 36.9288 5.15275 36.7959 5.18576C36.6631 5.21877 36.5312 5.25504 36.4002 5.29455C36.2692 5.33406 36.1391 5.37677 36.0102 5.42269C35.8813 5.46861 35.7537 5.51767 35.6271 5.56987C35.5006 5.62209 35.3755 5.67737 35.2517 5.73575C35.1279 5.79412 35.0057 5.85551 34.8849 5.91989C34.7642 5.98431 34.6451 6.05165 34.5276 6.12193C34.4102 6.19216 34.2946 6.26526 34.1807 6.34124C34.0669 6.41722 33.955 6.49595 33.845 6.57743C33.7351 6.65888 33.6272 6.743 33.5214 6.8298C33.4156 6.91659 33.312 7.00595 33.2106 7.09786C33.1092 7.18974 33.0101 7.28407 32.9133 7.38087C32.8166 7.47763 32.7223 7.57673 32.6304 7.67818C32.5385 7.77958 32.4492 7.88319 32.3624 7.98902C32.2757 8.09488 32.1916 8.20278 32.1101 8.31275C32.0286 8.42271 31.9499 8.53462 31.874 8.64849C31.7981 8.76232 31.725 8.87796 31.6547 8.99542C31.5845 9.11288 31.5172 9.23198 31.4528 9.35273C31.3885 9.47351 31.3271 9.59579 31.2687 9.71958C31.2104 9.84337 31.1552 9.96851 31.103 10.095C31.0508 10.2215 31.0018 10.3492 30.9558 10.4782C30.9099 10.6071 30.8673 10.7371 30.8278 10.8682C30.7883 10.9992 30.7521 11.1311 30.719 11.2639C30.6861 11.3967 30.6564 11.5303 30.63 11.6646C30.6036 11.7988 30.5805 11.9336 30.5607 12.0691C30.541 12.2045 30.5246 12.3403 30.5115 12.4766C30.4984 12.6128 30.4887 12.7492 30.4824 12.8859C30.4761 13.0226 30.4731 13.1594 30.4735 13.2963C30.4739 13.4332 30.4776 13.5699 30.4847 13.7066C30.4919 13.8432 30.5024 13.9796 30.5163 14.1158C30.5301 14.2519 30.5473 14.3876 30.5678 14.5229C30.5884 14.6582 30.6122 14.7929 30.6394 14.9271C30.6666 15.0612 30.6971 15.1945 30.7308 15.3272C30.7646 15.4598 30.8016 15.5915 30.8418 15.7224C30.8821 15.8531 30.9255 15.9829 30.9721 16.1115C31.0188 16.2402 31.0686 16.3676 31.1214 16.4939C31.1744 16.6201 31.2303 16.7449 31.2894 16.8683C31.3485 16.9917 31.4106 17.1137 31.4756 17.2341C31.5406 17.3545 31.6087 17.4732 31.6796 17.5903C31.7505 17.7073 31.8242 17.8225 31.9008 17.9359C31.9775 18.0493 32.0568 18.1608 32.1388 18.2703C32.221 18.3798 32.3057 18.4872 32.3931 18.5925C32.4805 18.6978 32.5704 18.8009 32.6628 18.9018C32.7553 19.0027 32.8502 19.1013 32.9475 19.1975L19.2 32.9475C19.1038 32.8502 19.0052 32.7553 18.9043 32.6629C18.8034 32.5704 18.7004 32.4805 18.595 32.3931C18.4897 32.3057 18.3823 32.2209 18.2727 32.1389C18.1633 32.0568 18.0518 31.9774 17.9384 31.9008C17.825 31.8242 17.7098 31.7504 17.5927 31.6795C17.4757 31.6086 17.357 31.5406 17.2366 31.4756C17.1162 31.4105 16.9943 31.3484 16.8708 31.2894C16.7474 31.2303 16.6226 31.1743 16.4964 31.1214C16.3701 31.0685 16.2427 31.0187 16.114 30.9721C15.9854 30.9254 15.8556 30.882 15.7249 30.8418C15.5941 30.8015 15.4624 30.7645 15.3297 30.7308C15.1971 30.697 15.0637 30.6666 14.9296 30.6394C14.7954 30.6122 14.6607 30.5883 14.5254 30.5678C14.3901 30.5472 14.2544 30.53 14.1183 30.5162C13.9821 30.5023 13.8457 30.4918 13.709 30.4847C13.5724 30.4775 13.4356 30.4738 13.2987 30.4734C13.1619 30.473 13.0251 30.476 12.8884 30.4824C12.7517 30.4887 12.6153 30.4983 12.479 30.5115C12.3428 30.5245 12.207 30.5409 12.0715 30.5607C11.9362 30.5804 11.8013 30.6035 11.667 30.6299C11.5327 30.6563 11.3992 30.686 11.2663 30.719C11.1336 30.752 11.0016 30.7882 10.8706 30.8277C10.7395 30.8672 10.6096 30.9099 10.4807 30.9558C10.3517 31.0017 10.224 31.0507 10.0975 31.1029C9.97098 31.1551 9.84584 31.2103 9.72205 31.2687C9.59826 31.327 9.47598 31.3884 9.3552 31.4528C9.23442 31.5171 9.11531 31.5844 8.99789 31.6547C8.88043 31.7249 8.76476 31.798 8.6509 31.874C8.53708 31.9499 8.42516 32.0286 8.31516 32.11C8.2052 32.1915 8.09731 32.2756 7.99149 32.3624C7.88567 32.4491 7.78204 32.5385 7.68059 32.6303C7.57918 32.7222 7.48008 32.8165 7.38328 32.9133C7.28653 33.01 7.19219 33.1091 7.10028 33.2105C7.0084 33.3119 6.91906 33.4156 6.83227 33.5214C6.74547 33.6272 6.66133 33.7351 6.57985 33.845C6.49836 33.955 6.41963 34.0668 6.34365 34.1807C6.26772 34.2945 6.19461 34.4102 6.12434 34.5276C6.05407 34.645 5.98674 34.7641 5.92237 34.8849C5.85795 35.0056 5.79656 35.1279 5.73818 35.2517C5.67981 35.3755 5.62452 35.5006 5.57231 35.6271C5.5201 35.7536 5.47104 35.8813 5.42513 36.0103C5.37921 36.1392 5.33649 36.2691 5.29698 36.4001C5.25747 36.5312 5.22121 36.6631 5.1882 36.7959C5.15519 36.9287 5.12547 37.0623 5.09904 37.1965C5.0726 37.3308 5.04949 37.4656 5.0297 37.6011C5.00992 37.7364 4.99348 37.8722 4.98038 38.0085C4.96728 38.1447 4.95755 38.2812 4.95117 38.4179C4.9448 38.5546 4.9418 38.6914 4.94217 38.8283C4.94254 38.9651 4.94627 39.1018 4.95338 39.2385C4.96048 39.3752 4.97095 39.5116 4.98478 39.6478C4.9986 39.7839 5.01577 39.9196 5.03629 40.0549C5.0568 40.1902 5.08064 40.3249 5.10779 40.4591C5.13494 40.5932 5.16538 40.7266 5.1991 40.8592C5.23282 40.9918 5.26979 41.1236 5.31001 41.2544C5.35022 41.3852 5.39363 41.515 5.44024 41.6436C5.48684 41.7723 5.53659 41.8997 5.58948 42.026C5.64236 42.1522 5.69833 42.277 5.75737 42.4005C5.8164 42.5239 5.87843 42.6458 5.94346 42.7663C6.00854 42.8866 6.07653 43.0054 6.14742 43.1225C6.21828 43.2396 6.29202 43.3548 6.36862 43.4682C6.44518 43.5816 6.52449 43.6931 6.60656 43.8026C6.68864 43.9121 6.77334 44.0196 6.86069 44.1249C6.94807 44.2303 7.03797 44.3334 7.13039 44.4343C7.22281 44.5352 7.31768 44.6337 7.41498 44.73C8.92998 46.245 10.89 47.025 12.8725 47.13C12.9775 49.1125 13.7575 51.07 15.2725 52.5875C15.3687 52.6847 15.4673 52.7797 15.5682 52.8721C15.6691 52.9645 15.7723 53.0544 15.8776 53.1418C15.983 53.2291 16.0904 53.3139 16.1999 53.396C16.3094 53.478 16.4209 53.5573 16.5343 53.6339C16.6477 53.7105 16.763 53.7842 16.88 53.8551C16.9971 53.926 17.1158 53.994 17.2362 54.0591C17.3566 54.1241 17.4786 54.1861 17.602 54.2452C17.7255 54.3042 17.8503 54.3602 17.9766 54.4131C18.1028 54.4659 18.2302 54.5157 18.3589 54.5623C18.4875 54.6089 18.6173 54.6523 18.7481 54.6925C18.8789 54.7327 19.0106 54.7697 19.1433 54.8034C19.2759 54.8372 19.4093 54.8676 19.5434 54.8948C19.6776 54.9219 19.8123 54.9458 19.9476 54.9663C20.0829 54.9868 20.2186 55.0039 20.3548 55.0178C20.4909 55.0316 20.6273 55.042 20.764 55.0492C20.9007 55.0563 21.0374 55.06 21.1742 55.0604C21.3111 55.0607 21.4479 55.0577 21.5846 55.0514C21.7213 55.045 21.8578 55.0352 21.994 55.0222C22.1303 55.009 22.2661 54.9926 22.4014 54.9728C22.5369 54.953 22.6717 54.9299 22.806 54.9035C22.9403 54.8771 23.0739 54.8474 23.2066 54.8144C23.3395 54.7814 23.4714 54.7451 23.6024 54.7056C23.7334 54.666 23.8634 54.6233 23.9923 54.5774C24.1212 54.5315 24.249 54.4825 24.3755 54.4303C24.502 54.3781 24.6271 54.3227 24.7509 54.2644C24.8747 54.206 24.997 54.1446 25.1177 54.0802C25.2384 54.0158 25.3575 53.9485 25.475 53.8782C25.5924 53.8079 25.7081 53.7348 25.8218 53.6589C25.9357 53.5829 26.0476 53.5042 26.1575 53.4227C26.2675 53.3412 26.3754 53.2571 26.4812 53.1703C26.587 53.0835 26.6906 52.9942 26.792 52.9023C26.8934 52.8104 26.9925 52.716 27.0893 52.6192C27.1861 52.5224 27.2804 52.4234 27.3722 52.3219C27.4641 52.2205 27.5535 52.1169 27.6402 52.0111C27.727 51.9052 27.811 51.7973 27.8925 51.6874C27.974 51.5774 28.0527 51.4655 28.1286 51.3516C28.2046 51.2378 28.2777 51.1221 28.3479 51.0047C28.4181 50.8872 28.4855 50.7681 28.5498 50.6474C28.6142 50.5266 28.6755 50.4043 28.7339 50.2805C28.7923 50.1567 28.8475 50.0316 28.8997 49.9051C28.9519 49.7785 29.0009 49.6508 29.0468 49.5219C29.0927 49.393 29.1354 49.263 29.1748 49.132C29.2143 49.0009 29.2506 48.8689 29.2836 48.7362C29.3165 48.6033 29.3463 48.4698 29.3726 48.3355C29.399 48.2012 29.4221 48.0664 29.4419 47.931C29.4616 47.7955 29.478 47.6597 29.4911 47.5235C29.5042 47.3872 29.5139 47.2508 29.5202 47.1141C29.5265 46.9774 29.5295 46.8406 29.5291 46.7037C29.5288 46.5669 29.525 46.4301 29.5178 46.2935C29.5107 46.1568 29.5002 46.0204 29.4864 45.8842C29.4725 45.7481 29.4553 45.6124 29.4347 45.4771C29.4142 45.3417 29.3903 45.207 29.3631 45.073C29.336 44.9388 29.3055 44.8054 29.2717 44.6728C29.238 44.5402 29.201 44.4084 29.1607 44.2777C29.1206 44.1469 29.0771 44.0172 29.0304 43.8885C28.9838 43.7598 28.934 43.6324 28.8811 43.5062C28.8282 43.3799 28.7722 43.2551 28.7132 43.1317C28.6541 43.0082 28.592 42.8863 28.5269 42.7659C28.4619 42.6455 28.3939 42.5268 28.323 42.4098C28.2521 42.2927 28.1783 42.1775 28.1017 42.0641C28.0251 41.9507 27.9457 41.8392 27.8637 41.7297C27.7816 41.6202 27.6968 41.5128 27.6094 41.4075C27.5221 41.3022 27.4321 41.1991 27.3397 41.0982C27.2472 40.9973 27.1523 40.8987 27.055 40.8025L40.8025 27.055C40.8987 27.1523 40.9973 27.2472 41.0982 27.3397C41.1991 27.4321 41.3021 27.522 41.4075 27.6094C41.5128 27.6968 41.6202 27.7815 41.7297 27.8637C41.8392 27.9458 41.9506 28.0251 42.0641 28.1017C42.1775 28.1783 42.2927 28.252 42.4097 28.323C42.5268 28.3939 42.6455 28.4619 42.7659 28.527C42.8863 28.5921 43.0082 28.6542 43.1317 28.7132C43.2551 28.7723 43.3799 28.8282 43.5061 28.8812C43.6323 28.9341 43.7598 28.9839 43.8885 29.0305C44.0171 29.0772 44.1469 29.1206 44.2776 29.1608C44.4085 29.201 44.5402 29.2381 44.6728 29.2718C44.8055 29.3056 44.9388 29.336 45.0729 29.3632C45.2071 29.3904 45.3418 29.4142 45.4771 29.4348C45.6124 29.4553 45.7481 29.4725 45.8842 29.4864C46.0204 29.5003 46.1569 29.5107 46.2935 29.5179C46.4301 29.525 46.5669 29.5288 46.7038 29.5292C46.8406 29.5296 46.9774 29.5266 47.1141 29.5203C47.2509 29.514 47.3873 29.5042 47.5235 29.4912C47.6597 29.4781 47.7955 29.4617 47.931 29.442C48.0664 29.4222 48.2013 29.3991 48.3355 29.3727C48.4698 29.3463 48.6034 29.3166 48.7362 29.2836C48.869 29.2507 49.0009 29.2144 49.132 29.1749C49.263 29.1355 49.393 29.0927 49.5219 29.0469C49.6509 29.001 49.7786 28.9519 49.9051 28.8998C50.0317 28.8476 50.1568 28.7923 50.2806 28.734C50.4044 28.6756 50.5267 28.6142 50.6474 28.5499C50.7682 28.4855 50.8873 28.4182 51.0047 28.348C51.1222 28.2777 51.2379 28.2046 51.3517 28.1287C51.4656 28.0528 51.5775 27.9741 51.6874 27.8926C51.7974 27.8111 51.9053 27.727 52.0111 27.6403C52.117 27.5535 52.2206 27.4642 52.322 27.3723C52.4235 27.2804 52.5225 27.1861 52.6193 27.0894C52.7161 26.9926 52.8105 26.8935 52.9023 26.7921C52.9942 26.6907 53.0836 26.5871 53.1704 26.4813C53.2572 26.3755 53.3413 26.2675 53.4228 26.1576C53.5043 26.0476 53.583 25.9357 53.659 25.8219C53.7349 25.7081 53.808 25.5925 53.8783 25.475C53.9486 25.3576 54.0159 25.2384 54.0803 25.1177C54.1447 24.9969 54.2061 24.8747 54.2644 24.7509C54.3228 24.6271 54.3781 24.502 54.4303 24.3755C54.4826 24.249 54.5316 24.1213 54.5775 23.9924C54.6234 23.8634 54.6661 23.7335 54.7056 23.6024C54.7452 23.4714 54.7814 23.3395 54.8144 23.2067C54.8475 23.0739 54.8772 22.9403 54.9036 22.806C54.93 22.6717 54.9531 22.5369 54.9729 22.4015C54.9927 22.266 55.0091 22.1302 55.0223 21.9941C55.0354 21.8578 55.0451 21.7214 55.0514 21.5847C55.0578 21.4479 55.0608 21.3111 55.0605 21.1743C55.0601 21.0374 55.0564 20.9007 55.0492 20.7641C55.0421 20.6274 55.0316 20.4909 55.0178 20.3548C55.004 20.2186 54.9868 20.0829 54.9663 19.9476C54.9458 19.8123 54.922 19.6775 54.8948 19.5434C54.8676 19.4092 54.8372 19.2759 54.8035 19.1433C54.7698 19.0106 54.7328 18.8789 54.6926 18.7481C54.6524 18.6173 54.6089 18.4876 54.5623 18.3589C54.5157 18.2302 54.466 18.1028 54.4131 17.9766C54.3602 17.8504 54.3043 17.7255 54.2452 17.602C54.1861 17.4785 54.1241 17.3566 54.059 17.2362C53.994 17.1158 53.926 16.9971 53.8551 16.88C53.7842 16.763 53.7105 16.6477 53.6339 16.5343C53.5574 16.4208 53.478 16.3094 53.3959 16.1999C53.3139 16.0904 53.2292 15.983 53.1418 15.8776C53.0545 15.7723 52.9646 15.6691 52.8721 15.5683C52.7796 15.4673 52.6848 15.3687 52.5875 15.2725C52.5425 15.2276 52.4969 15.1833 52.4508 15.1396C52.4048 15.0958 52.3582 15.0526 52.3111 15.0099C52.2641 14.9672 52.2166 14.9251 52.1685 14.8835C52.1205 14.8419 52.072 14.8008 52.023 14.7603C51.974 14.7198 51.9246 14.6799 51.8747 14.6405C51.8249 14.6012 51.7745 14.5624 51.7237 14.5242C51.673 14.486 51.6217 14.4484 51.57 14.4114C51.5184 14.3744 51.4664 14.338 51.4139 14.3022C51.3614 14.2663 51.3085 14.2311 51.2552 14.1966C51.2019 14.1619 51.1482 14.128 51.0941 14.0946C51.0401 14.0612 50.9856 14.0285 50.9308 13.9964C50.8759 13.9643 50.8207 13.9328 50.7652 13.902C50.7096 13.8711 50.6537 13.8409 50.5974 13.8114C50.5412 13.7818 50.4846 13.7529 50.4277 13.7247C50.3708 13.6964 50.3136 13.6688 50.256 13.6419C50.1985 13.615 50.1406 13.5887 50.0825 13.5631C50.0243 13.5374 49.9659 13.5125 49.9071 13.4883C49.8484 13.464 49.7894 13.4404 49.7301 13.4176C49.6708 13.3947 49.6113 13.3724 49.5515 13.3509C49.4917 13.3294 49.4317 13.3086 49.3714 13.2884C49.3112 13.2683 49.2507 13.2488 49.19 13.2301C49.1293 13.2113 49.0684 13.1933 49.0072 13.1759C48.9461 13.1585 48.8848 13.1419 48.8233 13.1259C48.7618 13.11 48.7001 13.0948 48.6382 13.0802C48.5764 13.0657 48.5144 13.0519 48.4521 13.0388C48.39 13.0257 48.3276 13.0133 48.2652 13.0017C48.2027 12.99 48.1401 12.9791 48.0774 12.9689C48.0147 12.9587 47.9519 12.9492 47.8889 12.9404C47.826 12.9316 47.763 12.9236 47.6999 12.9162C47.6368 12.9089 47.5735 12.9024 47.5103 12.8965C47.447 12.8906 47.3837 12.8854 47.3203 12.8811C47.2569 12.8766 47.1935 12.8729 47.13 12.87Z"   fill="#FF8D1A" >
          </path>
          <rect x="891.999755859375" y="0" width="1012" height="98"   fill="#CCCCCC" >
          </rect>
          </g>
          <defs>
          <clipPath id="clip-path-85_80">
          <path d="M1.30982e-07 60L60 60L60 -1.30982e-07L0 0L1.30982e-07 60Z" fill="white"/>
          </clipPath>
          </defs>
        </svg>

      </div>

      <!-- 换一换按钮 -->
      <div class="change" @click="change()">
        <i class="el-icon-refresh"></i>
        换一换
      </div>
    </section>

    <!-- AI兽医 -->
    <section class="right">
      <!-- 标题 -->
      <div class="header">
        <p class="title">AI智能-宠物医生在线咨询</p>
      </div>

      <!-- AI -->
      <div class="container">
        <!-- 问答示例 -->
        <div class="example">
          <p class="title">问答示例</p>

          <div class="example_box">
            <p class="ability">宠物猫咪智能问诊</p>
            <p class="problem">
              <span class="sign">Q</span>
              小猫得了猫瘟能治好吗？打疫苗有用吗？
            </p>
            <p class="answer">
              <span class="sign">A</span>
              AI宠物医生随时随地问诊，给予治疗建议
            </p>
          </div>

          <div class="example_box">
            <p class="ability">猫咪用药分析指南</p>
            <p class="problem">
              <span class="sign">Q</span>
              宠物医院开的硫糖铝片和甲氧氯普胺，能同时吃吗?
            </p>
            <p class="answer">
              <span class="sign">A</span>
              AI宠物医生可以对处方单进行一键识别，分析用药是否合理
            </p>
          </div>

          <div class="example_box">
            <p class="ability">宠物猫咪健康测评</p>
            <p class="problem">
              <span class="sign">Q</span>
              我的猫猫是橘猫，5个月体重5kg正常吗?
            </p>
            <p class="answer">
              <span class="sign">A</span>
              AI宠物医生通过品种年龄、体重饮食、运动等多个维度分析
            </p>
          </div>

        </div>

        <!-- 中间的图片 -->
        <div class="pic">
          <img src="../assets/AIdoc_img.jpeg" alt="">
        </div>

        <!-- AI问答区 -->
        <div class="AI">
          <p class="title">AI问答区</p>
          <div class="ask">
            <span class="sign">Q</span>
            <textarea name="" id="" placeholder="请输入您想咨询的问题" v-model="userProblem" @keyup.enter.exact="sendProblem()"></textarea>
            <button class="send_problem" @click="sendProblem()"><i class="el-icon-top"></i></button>
          </div>
          <div class="AIanswer">
            <span class="sign">A</span>
            <div class="answer" v-html="currentText" :class="{typing:typingEffect,cursorBlink:cursorBlink}" ref="answer" @scroll="hanldeScroll">

            </div>
              <!-- {{ currentText }} -->
              <!-- <span class="typing-cursor"></span> -->
          </div>
        </div>

      </div>

      <!-- 底部 -->
      <div class="footer">

        <!-- 五个小方块 -->
        <div class="stage">

          <div class="box">
            <p class="age">幼年期</p>
            <p class="detail">
              (0-6个月)<br>腹泻 结膜炎 感冒寄生虫感染 营养不良
            </p>
          </div>

          <div class="box">
            <p class="age">青年期</p>
            <p class="detail">
              (6个月-2岁)<br>呕吐 软便 龋齿寄生虫感染 咬人抓人
            </p>
          </div>

          <div class="box">
            <p class="age">壮年期</p>
            <p class="detail">
              (3-6岁)<br>牙结石 关节炎 肥胖肥厚性心肌 皮肤病
            </p>
          </div>

          <div class="box">
            <p class="age">中年期</p>
            <p class="detail">
              (7~10岁)<br>糖尿病 白内障 关节炎 寄生虫感染 尿路感染
            </p>
          </div>

          <div class="box">
            <p class="age">老年期</p>
            <p class="detail">
              (11岁及以上)<br> 免疫衰退 心脏病 慢性肾疾病 甲状腺异常
            </p>
          </div>

        </div>

        <!-- 字和装饰 -->
        <div class="background">
          <p>
            您的AI宠物医生，24小时在线咨询<br>
            为您提供一个更科学更健康的养宠方式
          </p>
        </div>
      </div>
    </section>

  </el-main>
</template>

<script>
import { askAI } from '@/api/AIDoc.js'
import { mapState } from 'vuex'
import { marked } from 'marked'
export default {
  data () {
    return {
      userProblem: '', // 用户的问题
      answer: '', // 储存后端返回来的回答
      //  `🐾 您的专属AI宠物医生正在全速思考中! 🐾
      //   毛茸茸的耳朵已经竖起来啦！正在：
      //   ▸ 仔细分析宝贝的每项症状.
      //   ▸ 翻阅云端十万+宠物病例库.
      //   ▸ 用虚拟爪爪检查体温数据.
      //   ▸ 准备三套定制诊疗方案.

      //   您可以：
      //   ✓ 轻抚手机屏幕给医生加油.
      //   ✓ 观察毛孩此刻的精神状态.
      //   ✓ 准备好最近的饮食记录.
      //   我们将在28秒后带着诊断结果蹦跶回来~`,
      currentIndex: 0, // 回答显示到哪里的索引
      currentText: '', // 回答显示的文本
      typingEffect: false, // 打字效果用于添加类，用于显示光标
      cursorBlink: false, // 用于开启光标的闪烁动画
      autoScroll: true,
      knowledgeIndex: [0, 1, 2, 3] // 用于显示的4个宠物科普知识（在list中的索引）
    }
  },
  methods: {
    // 打出一个字符, 并调用自身, 实现连续打字效果
    tpying () {
      if (this.currentIndex <= this.answer.length) {
        // 显示光标
        this.typingEffect = true
        // 关闭光标闪烁动画
        this.cursorBlink = false

        // 文本更新，即 打出下一个字符
        this.currentText = this.answer.substring(0, this.currentIndex)
        // 添加元素当作光标
        this.currentText += '<span class="typing-cursor"></span>'
        // markdown语法效果
        this.currentText = marked(this.currentText)

        // 如果是 打完最后一个字隐藏光标
        if (this.currentIndex === this.answer.length) this.typingEffect = false

        this.currentIndex++

        // 自动滚动到底部
        if (this.autoScroll) this.$refs.answer.scrollTop = this.$refs.answer.scrollHeight

        // 以下为 调用自身的逻辑
        // 随机生成下一个字符的显示时间间隔(50ms-100ms)
        // let randomTime = Math.random() * 100 + 50
        let randomTime = Math.random() * 10 + 50
        // 在打完标点符号后 随机(50%)增加长停顿
        const currentChar = this.answer[this.currentIndex - 2] // 因为刚刚索引+1了,substring是左闭右开,所以-2才是当前字符
        if ([',', '，', '.', '。', '!', '！', '?', '？', '\n'].includes(currentChar)) { // 打完标点后
          // 随机增加长停顿
          if (Math.random() >= 0.5) {
            // randomTime = Math.floor(Math.random() * (1500 - 750 + 1)) + 750 // 长停顿(750ms-1500ms)，时间与光标设定的闪烁动画时间(0.75s)有关
            randomTime = Math.floor(Math.random() * (100 + 1)) + 750
          }
          this.cursorBlink = true // 开启光标闪烁动画
        }
        const handleNext = setTimeout(() => {
          // 调用自身
          this.tpying()
          // 清除定时器
          clearTimeout(handleNext)
        }, randomTime)
      }
    },
    // 当用户滚动时，触发该函数
    hanldeScroll (e) {
      const container = e.target
      // 计算距离底部的距离
      const distanceToBottom = container.scrollHeight - (container.scrollTop + container.clientHeight)

      // 如果用户滚动到接近底部（小于50），则重新启用自动滚动
      this.autoScroll = distanceToBottom < 50
    },
    // 宠物科普的换一换
    change () {
      if (this.knowledgeIndex[3] >= this.knowledgeList.length - 1) {
        this.knowledgeIndex = this.knowledgeIndex.map((item, index) => index)
      } else {
        this.knowledgeIndex = this.knowledgeIndex.map(item => item + 4)
      }
    },
    // 发送用户咨询的问题
    async sendProblem () {
      try {
        this.currentText = '宠物医生正在思考...'
        const res = await askAI(this.userProblem)
        this.userProblem = ''
        this.answer = res.data
        this.currentText = ''
        this.currentIndex = 0
        this.tpying()
        // console.log(marked(this.answer))
      } catch (error) {
        console.log(error)
      }
    }
  },
  computed: {
    // 宠物科普知识的数据
    ...mapState('knowledge', ['knowledgeList'])
  }
}
</script>

<style scoped>
  .el-main {
    width: 99vw;
    height: 110vh;
    background: rgba(250, 240, 225, 0.3);
    display: flex;
    flex-wrap: nowrap;
    gap: 2%;
  }
  .left,.right{
    background: #FBFAF8;
    border-radius: 20px;
    box-shadow: 0px 2px 4px
  }

  /* 左边 */
  .left{
    width: 43%;
    height: 100%;
    display: flex;
    flex-wrap: wrap;
    position: relative;
    background: url(https://img.js.design/assets/img/67a8af106a10bb242b22d898.png#cd0ad88827d85ed0b3605fcea4ee5786);
    background-size: 112% 99%;
    background-position: 39% 0%;
  }
  /* 便利贴 */
  .left>.item{
    width: 50%;
    height: 50%;
  }
  .left>.item>img{
    width: 90%;
    position: relative;
    top: 6%;
    left: 1%;
  }
  .left>.item:nth-child(2)>img{
    width: 90%;
    position: relative;
    top: 6%;
    left: 15%;
  }
  .left>.item:nth-child(3)>img{
    width: 85%;
    position: relative;
    top: 11%;
    left: 0%;
  }
  .left>.item:nth-child(4)>img{
    width: 90%;
    position: relative;
    top: 7%;
    left: 22%;
  }
  /* 便利贴文字 */
  .left>.item>p{
    position: absolute;
    line-height: 140%;
    color: #565656;
  }
  .left>.item>.content{
    display: -webkit-box;
    -webkit-box-orient: vertical;
    -webkit-line-clamp: 9;
    overflow: hidden;
    text-overflow: ellipsis;
    font-size: 0.96vw;
  }
  .left>.item>.title{
    font-size: 1.211vw;
    font-weight: 600;
  }
  .left>.one>.title{
    top:2.5%;
    left: 15%;
    transform: skew(347deg, 11deg);
  }
  .left>.two>.title{
    top:2%;
    right: 17%;
    transform: skew(5deg, 339deg);
  }
  .left>.three>.title{
    top:56%;
    left: 12%;
    transform: skew(9deg, 354deg);
  }
  .left>.four>.title{
    top:54%;
    right: 7%;
    transform: skew(360deg, 356deg);
  }
  .left>.item>.content::before{
    content: '';
    width: 28%;
    height: 19.5%;
    display: block;
    float: left;
  }
  .left>.one>.content{
    top: 10.25%;
    left: 6.5%;
    width: 27.5%;
    height: 23%;
    transform: skew(347deg, 12deg);
  }
  .left>.two>.content{
    top: 11%;
    right: 8%;
    width: 27.5%;
    height: 24%;
    transform: skew(11deg, 348deg);
  }
  .left>.three>.content{
    top: 62%;
    left: 4.5%;
    width: 29%;
    height: 24%;
    transform: skew(5deg, 355deg);
  }
  .left>.four>.content{
    top: 60.5%;
    right: 5%;
    width: 27.5%;
    height: 24%;
    transform: skew(350deg, 11deg);
  }
  .left>.item>.content>.barrier{
    display: block;
    width: 24%;
    height: 100%;
    float: right;
    shape-outside: inset(72% 0 0 0);
  }
  /* 装饰图片 */
  .left>.decoration{
    width: 100%;
    height: 100%;
    position: absolute;
  }
  .left>.decoration>svg{
    position: absolute;
    width: 3.04vw;
  }
  .left>.decoration>:nth-child(1){
    top: 25%;
    left: 39%;
  }
  .left>.decoration>:nth-child(2){
    top: 31%;
    left: 47%;
  }
  .left>.decoration>:nth-child(3){
    top: 38%;
    left: 54%;
  }
  .left>.decoration>:nth-child(4){
    top: 45%;
    left: 45%;
  }
  .left>.decoration>:nth-child(5){
    top: 52%;
    left: 37%;
  }
  .left>.decoration>:nth-child(6){
    top: 60%;
    left: 45%;
  }
  .left>.decoration>:nth-child(7){
    top: 67%;
    left: 53%;
  }
  .left>.decoration>:nth-child(8){
    top: -1%;
    left: 1%;
  }
  .left>.decoration>:nth-child(9){
    top: -1%;
    left: 60%;
  }
  .left>.decoration>:nth-child(10){
    top: 50%;
    left: 1%;
  }
  .left>.decoration>:nth-child(11){
    top: 47%;
    left: 72%;
  }
  /* 换一换按钮 */
  .left>.change{
    position: absolute;
    top: 1%;
    left: 42%;
    font-size: 1.1vw;
    cursor: pointer;
    font-weight: 600;
    color:#FF8D1A;
    letter-spacing: 3px;
  }

  /* 右边 */
  .right{
    width: 55%;
    display: flex;
    flex-wrap: nowrap;
    flex-direction: column;
  }
  .header{
    width: 100%;
    height: 13%;
    display: flex;
    justify-content: center;
    align-items: center;
  }
  .header>.title{
    font-size: 2.02vw;
    font-weight: 500;
    color: rgba(56, 56, 56, 1);
  }

  .container{
    width: 100%;
    height: 66%;
    display: flex;
    flex-wrap: nowrap;
    /* gap: 10%; */
  }
  .container>.example{
    height: 100%;
    width: 39%;
    display: flex;
    flex-direction: column;
    flex-wrap: nowrap;
    z-index: 1;
  }
  .container .title{
    font-size: 1.515vw;
    color: rgba(56, 56, 56, 1);
    font-weight: 500;
    width: 100%;
    height: 6%;
    text-align: center;
    padding-bottom: 5%;
  }
  .container>.example>.example_box{
    width: 95%;
    /* height: 20%; */
    padding: 0 0 5% 5%;
  }
  .container>.example>.example_box>.ability{
    font-size:1.1617vw;
    font-weight: 500;
    color: rgba(56, 56, 56, 1);
    line-height: 200%;
  }
  .container>.example>.example_box>.problem{
    font-size:0.9vw;
    font-weight: 500;
    color: rgba(128, 128, 128, 1);
    line-height: 200%;
    width: 100%;
  }
  .container>.example>.example_box>.problem>.sign{
    color: white;
    background: rgba(255, 141, 26, 1);
    padding: 0 3px;
    border-radius: 5px;
  }
  .container>.example>.example_box>.answer{
    font-weight: 500;
    color: rgba(128, 128, 128, 1);
    line-height: 200%;
    width: 100%;
    font-size: 0.9vw;
  }
  .container>.example>.example_box>.answer>.sign{
    color: white;
    background: rgba(67, 207, 124, 1);
    padding: 0 3px;
    border-radius: 5px;
  }

  .container>.pic{
    height: 100%;
    width: 20%;
    z-index: 0;
  }
  .container>.pic>img{
    width: 300%;
    position: relative;
    left: -98%;
  }
  .container>.AI{
    height: 100%;
    width: 41%;
    display: flex;
    flex-wrap:nowrap ;
    flex-direction: column;
    z-index: 1;
  }
  .container>.AI>.ask{
    width: 97%;
    height: 25%;
    padding-left:3% ;
    display: flex;
    align-items: start;
    gap: 10px;
    position: relative;
  }
  .container>.AI>.ask>.sign{
    font-size: 20px;
    color: white;
    background: rgba(255, 141, 26, 1);
    padding: 0 3px;
    border-radius: 5px;
  }
  .container>.AI>.ask>textarea{
    width: 90%;
    height: 90%;
    border: none;
    outline: none;
    border-radius: 10px;
    background: rgba(248, 250, 251, 1);
    box-shadow: 0px 2px 4px  rgba(0, 0, 0, 0.25);
    box-sizing: border-box;
    padding: 10px;
    font-size: 1.1617vw;
  }
  .container>.AI>.ask>.send_problem{
    border-radius: 50%;
    position: absolute;
    top: 60%;
    right:5%;
    background: #FF8D1A;
    color: white;
    width: 10%;
    height: 25%;
    border: none;
    cursor: pointer;
  }
  .container>.AI>.AIanswer{
    width: 97%;
    height: 60%;
    padding-left:3% ;
    display: flex;
    align-items: start;
    gap: 10px;
  }
  .container>.AI>.AIanswer>.sign{
    font-size: 20px;
    color: white;
    background: rgba(67, 207, 124, 1);
    padding: 0 3px;
    border-radius: 5px;
  }
  .container>.AI>.AIanswer>.answer{
    background: white;
    width: 90%;
    height: 100%;
    border-radius: 10px;
    background: rgba(248, 250, 251, 1);
    box-shadow: 0px 2px 4px  rgba(0, 0, 0, 0.25);
    box-sizing: border-box;
    padding: 10px;
    font-size: 1.1617vw;
    /*white-space: pre-line ;*//*支持换行*/
    overflow-y: auto;
  }
  ::v-deep .typing .typing-cursor{
    display: inline-block;
    width: 0.55em;
    height: 0.55em;
    background-color: #000;
    margin-left: 0.5em;
    position: relative;
    top: -0.125em;
    border-radius:50%;
  }
  ::v-deep .cursorBlink .typing-cursor{
    animation: blink 0.75s  infinite;
  }
  @keyframes blink {
    0% {
        opacity: 1;
    }
    50% {
      opacity: 0;
    }
    100% {
        opacity: 1;
    }
  }
  ::v-deep .container>.AI>.AIanswer>.answer {
    font-family: Arial, sans-serif;
    line-height: 1.5;
  }
  ::v-deep .container>.AI>.AIanswer>.answer ol {
    padding-left: 20px;
    /* list-style-type: disc; */
  }
  ::v-deep .container>.AI>.AIanswer>.answer a {
    color: #0366d6;
    text-decoration: none;
  }
  ::v-deep .container>.AI>.AIanswer>.answer a:hover {
    text-decoration: underline;
  }

  .footer{
    width: 96%;
    height: 18%;
    border-radius: 13.05px;
    margin: 2%;
  }
  .footer>.stage{
    width: 100%;
    height: 30%;
    display: flex;
    position: relative;
    justify-content: space-around;
    top: -10%;
  }
  .footer>.stage>.box{
    height: 200%;
    width: 15%;
    border-radius: 10px;
    background: rgba(255, 255, 255, 1);
    box-shadow: 0px 2px 4px  rgba(0, 0, 0, 0.25);
    padding: 1.5% 1.5%;
    box-sizing: border-box;
  }
  .footer>.stage>.box>.age{
    font-size: 0.75vw;
    color: rgba(56, 56, 56, 1);
    font-weight:500;
    padding-bottom:3px ;
  }
  .footer>.stage>.box>.detail{
    font-size: 0.6vw;
    color: rgba(128, 128, 128, 1);
    font-weight:500;
  }

  .footer>.background{
    width: 100%;
    height: 70%;
    background: rgba(255, 141, 26, 1);
    border-radius: 13.05px;
  }
  .footer>.background>p{
    text-align: center;
    padding: 5% 0;
    color: white;
    font-size: 1.1617vw;
    line-height: 150%;
  }

</style>
